#!/bin/bash
#######################################################################################
#
# <スクリプト名>
# 温湿度情報ログローテーションスクリプト
#
# <概要>
# 温湿度情報ログのローテーション処理を行う
#
# <更新履歴>
# 20210906 - 新規作成
#
#######################################################################################

#####################################################################
## 事前設定
#####################################################################
# 日時取得
data=`date "+%Y%m%d"`


#####################################################################
## パラメーター設定
#####################################################################
#設定ファイルから変数を取得
source ../01_param/common.conf


#####################################################################
## ローテーション処理
#####################################################################

exec >> ${LogOldPath} 2>&1
### ログローテート処理 ###
if [ -e ${LogPath} ]; then
  # ログファイルをoldログへ変換
  sudo mv ${LogPath} ${LogOldPath}
  # 新しいログファイルを作成
  sudo touch ${LogPath}
  # 移動したログファイルを圧縮
  sudo zip -j ${LogZip} ${LogOldPath}
  # 移動したログファイルを削除
  sudo rm -f ${LogOldPath}
else
  exit 2
fi
